[
  {
    "id": "mortality_by_category",
    "title": "Average Mortality Rate by Disease Category",
    "description": "This bar chart shows the average mortality rate for different disease categories. Autoimmune diseases have the highest mortality rate at around 5.12%, followed by Bacterial and Cardiovascular diseases.",
    "insight": "Autoimmune diseases show the highest mortality rates, suggesting a need for improved treatments and earlier diagnosis in this category.",
    "file_html": "mortality_by_category.html",
    "file_png": "mortality_by_category.png",
    "chart_type": "Bar Chart",
    "data_source": "Global Health Dataset"
  },
  {
    "id": "mortality_over_years",
    "title": "Mortality Rate Over Years",
    "description": "This line chart tracks the average mortality rate across all diseases over time. There are notable fluctuations, with a significant dip around 2015.",
    "insight": "The mortality rate shows cyclical patterns with a major decrease around 2015, possibly indicating the impact of global health initiatives or improved treatment protocols during that period.",
    "file_html": "mortality_over_years.html",
    "file_png": "mortality_over_years.png",
    "chart_type": "Line Chart",
    "data_source": "Global Health Dataset"
  },
  {
    "id": "urbanization_vs_mortality",
    "title": "Urbanization Rate vs Mortality Rate by Country",
    "description": "This bubble chart explores the relationship between urbanization rates and mortality rates across different countries. The size of each bubble represents the population affected.",
    "insight": "There appears to be no strong correlation between urbanization and mortality rates, suggesting that other factors like healthcare quality and disease management may have more significant impacts on mortality outcomes.",
    "file_html": "urbanization_vs_mortality.html",
    "file_png": "urbanization_vs_mortality.png",
    "chart_type": "Bubble Chart",
    "data_source": "Global Health Dataset"
  },
  {
    "id": "education_vs_prevalence",
    "title": "Education Index vs Prevalence Rate by Country",
    "description": "This scatter plot examines the relationship between a country's education index and disease prevalence rates. The size of each point indicates the number of diseases recorded in that country.",
    "insight": "Countries with higher education indices tend to have lower disease prevalence rates, suggesting that education may play a role in disease prevention and health awareness.",
    "file_html": "education_vs_prevalence.html",
    "file_png": "education_vs_prevalence.png",
    "chart_type": "Scatter Plot",
    "data_source": "Global Health Dataset"
  },
  {
    "id": "mortality_heatmap",
    "title": "Heatmap of Mortality Rate by Country and Disease",
    "description": "This heatmap visualizes mortality rates across different countries and diseases, with darker red indicating higher mortality rates.",
    "insight": "The heatmap reveals specific country-disease combinations with exceptionally high mortality rates, highlighting areas where targeted interventions could be most beneficial.",
    "file_html": "mortality_heatmap.html",
    "file_png": "mortality_heatmap.png",
    "chart_type": "Heatmap",
    "data_source": "Global Health Dataset"
  },
  {
    "id": "life_expectancy_over_time",
    "title": "Average Life Expectancy Over Time",
    "description": "This area chart shows how global average life expectancy has changed over time.",
    "insight": "Life expectancy has shown a general upward trend over the years, reflecting improvements in healthcare, nutrition, and living conditions worldwide.",
    "file_html": "life_expectancy_over_time.html",
    "file_png": "life_expectancy_over_time.png",
    "chart_type": "Area Chart",
    "data_source": "Life Expectancy Dataset"
  },
  {
    "id": "disease_population_treemap",
    "title": "Total Population Affected by Disease Category",
    "description": "This treemap visualizes the total population affected by each disease category, with larger areas representing more affected people.",
    "insight": "Viral diseases affect the largest population globally, followed by respiratory diseases, highlighting the significant public health burden of these disease categories.",
    "file_html": "disease_population_treemap.html",
    "file_png": "disease_population_treemap.png",
    "chart_type": "Treemap",
    "data_source": "Global Health Dataset"
  },
  {
    "id": "mortality_choropleth",
    "title": "Average Mortality Rate by Country",
    "description": "This choropleth map displays average mortality rates across different countries, with darker red indicating higher mortality rates.",
    "insight": "There are significant geographical disparities in mortality rates, with some regions showing consistently higher rates that may be linked to healthcare access, economic factors, or disease burden.",
    "file_html": "mortality_choropleth.html",
    "file_png": "mortality_choropleth.png",
    "chart_type": "Choropleth Map",
    "data_source": "Global Health Dataset"
  },
  {
    "id": "cholesterol_by_gender",
    "title": "Cholesterol Distribution by Gender",
    "description": "This violin plot shows the distribution of cholesterol levels between males and females in the heart disease dataset.",
    "insight": "Females show a wider distribution of cholesterol levels with a higher median value compared to males, which could be relevant for gender-specific approaches to cardiovascular health.",
    "file_html": "cholesterol_by_gender.html",
    "file_png": "cholesterol_by_gender.png",
    "chart_type": "Violin Plot",
    "data_source": "Heart Disease Dataset"
  },
  {
    "id": "age_by_heart_disease",
    "title": "Age Distribution by Heart Disease Presence",
    "description": "This box plot compares the age distribution between individuals with and without heart disease.",
    "insight": "Individuals with heart disease tend to be older on average, confirming age as a significant risk factor for cardiovascular conditions.",
    "file_html": "age_by_heart_disease.html",
    "file_png": "age_by_heart_disease.png",
    "chart_type": "Box Plot",
    "data_source": "Heart Disease Dataset"
  },
  {
    "id": "top_countries_life_expectancy",
    "title": "Top 10 Countries by Average Life Expectancy",
    "description": "This bar chart shows the top 10 countries with the highest average life expectancy.",
    "insight": "The top-ranking countries for life expectancy are predominantly developed nations with strong healthcare systems and high standards of living.",
    "file_html": "top_countries_life_expectancy.html",
    "file_png": "top_countries_life_expectancy.png",
    "chart_type": "Bar Chart",
    "data_source": "Life Expectancy Dataset"
  },
  {
    "id": "gdp_vs_life_expectancy",
    "title": "GDP vs Life Expectancy",
    "description": "This scatter plot explores the relationship between a country's GDP and life expectancy, with point size representing population.",
    "insight": "There is a positive correlation between GDP and life expectancy, though the relationship plateaus at higher GDP levels, suggesting diminishing returns on healthcare investment beyond a certain point.",
    "file_html": "gdp_vs_life_expectancy.html",
    "file_png": "gdp_vs_life_expectancy.png",
    "chart_type": "Scatter Plot",
    "data_source": "Life Expectancy Dataset"
  },
  {
    "id": "heart_disease_parallel",
    "title": "Heart Disease Feature Comparison",
    "description": "This parallel coordinates plot shows the relationships between multiple features related to heart disease.",
    "insight": "Patients with heart disease tend to have distinct patterns across multiple health metrics, particularly in maximum heart rate and ST depression during exercise, which could be valuable for early detection.",
    "file_html": "heart_disease_parallel.html",
    "file_png": "heart_disease_parallel.png",
    "chart_type": "Parallel Coordinates Plot",
    "data_source": "Heart Disease Dataset"
  }
]